/*******************************************************************************
 * Size: 9 px
 * Bpp: 2
 * Opts: --bpp 2 --size 9 --font C:/Users/Dmitriy/SquareLine/examples/Vector/assets/fonts/ofont.ru_Roboto.ttf -o C:/Users/Dmitriy/SquareLine/examples/Vector/assets/fonts\ui_font_number9.c --format lvgl -r 0x20-0x7F -r 0xB0 -r 0x2022 -r 0x410-0x44f -r 0x451 --no-compress --no-prefilter
 ******************************************************************************/

#include "../ui.h"

#ifndef UI_FONT_NUMBER9
#define UI_FONT_NUMBER9 1
#endif

#if UI_FONT_NUMBER9

/*-----------------
 *    BITMAPS
 *----------------*/

/*Store the image of the glyphs*/
static LV_ATTRIBUTE_LARGE_CONST const uint8_t glyph_bitmap[] = {
    /* U+0020 " " */

    /* U+0021 "!" */
    0x66, 0x66, 0x10, 0x20,

    /* U+0022 "\"" */
    0xaa, 0x50, 0x0,

    /* U+0023 "#" */
    0x8, 0x80, 0x84, 0x2f, 0x81, 0x60, 0x7b, 0x82,
    0x20, 0x22, 0x0,

    /* U+0024 "$" */
    0x8, 0x7, 0x83, 0x24, 0x80, 0x2d, 0x0, 0x95,
    0x18, 0xec, 0x8, 0x0,

    /* U+0025 "%" */
    0x68, 0x2, 0x22, 0x2, 0x94, 0x0, 0x80, 0x4,
    0xa0, 0x24, 0x40, 0xa, 0x0,

    /* U+0026 "&" */
    0x2e, 0x3, 0x30, 0x36, 0x2, 0xc0, 0x99, 0x88,
    0x3c, 0x2a, 0xc0,

    /* U+0027 "'" */
    0x88, 0x0,

    /* U+0028 "(" */
    0x0, 0x22, 0x8, 0x61, 0x46, 0x8, 0x20, 0x20,
    0x0,

    /* U+0029 ")" */
    0x2, 0x2, 0x8, 0x24, 0x92, 0x4c, 0x22, 0x0,
    0x0,

    /* U+002A "*" */
    0x14, 0xa9, 0x28, 0x14,

    /* U+002B "+" */
    0x8, 0x3, 0xb, 0xf8, 0x30, 0xc, 0x0,

    /* U+002C "," */
    0x9, 0x80,

    /* U+002D "-" */
    0xa0,

    /* U+002E "." */
    0x60,

    /* U+002F "/" */
    0x5, 0x8, 0x8, 0x20, 0x20, 0x50, 0x80,

    /* U+0030 "0" */
    0x2a, 0x18, 0x55, 0x1a, 0x46, 0x51, 0x98, 0x52,
    0xa0,

    /* U+0031 "1" */
    0x4, 0xb0, 0xc3, 0xc, 0x30, 0xc0,

    /* U+0032 "2" */
    0x2a, 0x14, 0x90, 0x24, 0xc, 0xc, 0x9, 0x7,
    0xa4,

    /* U+0033 "3" */
    0x2a, 0x14, 0x90, 0x20, 0x2c, 0x2, 0x54, 0x52,
    0xa0,

    /* U+0034 "4" */
    0x3, 0x2, 0xc1, 0xb0, 0xcc, 0x63, 0x2a, 0xe0,
    0x30,

    /* U+0035 "5" */
    0x3f, 0x4c, 0x3, 0xe0, 0x49, 0x1, 0x88, 0x52,
    0xa0,

    /* U+0036 "6" */
    0x1a, 0x8, 0x6, 0xa1, 0x86, 0x50, 0x88, 0x61,
    0xa0,

    /* U+0037 "7" */
    0x6b, 0x80, 0x80, 0x60, 0x20, 0xc, 0x2, 0x1,
    0x40,

    /* U+0038 "8" */
    0x2a, 0x18, 0x92, 0x24, 0xb8, 0x61, 0x54, 0x62,
    0xa0,

    /* U+0039 "9" */
    0x2a, 0x14, 0x99, 0x15, 0x4a, 0x2a, 0x40, 0x92,
    0xa0,

    /* U+003A ":" */
    0x60, 0x0, 0x60,

    /* U+003B ";" */
    0x60, 0x0, 0x64,

    /* U+003C "<" */
    0x1, 0x1e, 0xa0, 0x1d, 0x1,

    /* U+003D "=" */
    0x3f, 0x0, 0x3, 0xf0,

    /* U+003E ">" */
    0x0, 0xa, 0x0, 0x34, 0xa4, 0x0, 0x0,

    /* U+003F "?" */
    0x3d, 0x43, 0x2, 0xc, 0x18, 0x0, 0x14,

    /* U+0040 "@" */
    0x6, 0xa0, 0x20, 0x8, 0x21, 0x91, 0x56, 0x22,
    0x48, 0x52, 0x48, 0x51, 0x56, 0x68, 0x20, 0x0,
    0xa, 0x90,

    /* U+0041 "A" */
    0x9, 0x0, 0xa0, 0x16, 0x2, 0x8, 0x3f, 0xc5,
    0x8, 0x80, 0x60,

    /* U+0042 "B" */
    0x3b, 0x42, 0xc, 0x20, 0xc3, 0xb4, 0x20, 0x82,
    0x8, 0x3a, 0x80,

    /* U+0043 "C" */
    0x1a, 0x42, 0x8, 0x50, 0x5, 0x0, 0x50, 0x2,
    0x8, 0x1a, 0x40,

    /* U+0044 "D" */
    0x3a, 0x42, 0xc, 0x20, 0x52, 0x6, 0x20, 0x52,
    0xc, 0x3a, 0x40,

    /* U+0045 "E" */
    0x3a, 0x82, 0x0, 0x20, 0x3, 0xa4, 0x20, 0x2,
    0x0, 0x3a, 0x80,

    /* U+0046 "F" */
    0x3a, 0x82, 0x0, 0x20, 0x3, 0xa4, 0x20, 0x2,
    0x0, 0x20, 0x0,

    /* U+0047 "G" */
    0x1a, 0x82, 0x9, 0x50, 0x5, 0x2d, 0x50, 0x53,
    0x5, 0x1a, 0x80,

    /* U+0048 "H" */
    0x20, 0x22, 0x2, 0x20, 0x23, 0xae, 0x20, 0x22,
    0x2, 0x20, 0x20,

    /* U+0049 "I" */
    0x22, 0x22, 0x22, 0x20,

    /* U+004A "J" */
    0x2, 0x0, 0x80, 0x20, 0x8, 0x2, 0x20, 0xc3,
    0xa0,

    /* U+004B "K" */
    0x20, 0x82, 0x18, 0x22, 0x3, 0xd0, 0x23, 0x2,
    0x18, 0x20, 0x90,

    /* U+004C "L" */
    0x20, 0x8, 0x2, 0x0, 0x80, 0x20, 0x8, 0x3,
    0xa4,

    /* U+004D "M" */
    0x30, 0xc, 0x34, 0x2c, 0x2c, 0x38, 0x28, 0x68,
    0x26, 0x88, 0x23, 0x8c, 0x22, 0x4c,

    /* U+004E "N" */
    0x30, 0x23, 0x82, 0x2c, 0x22, 0x22, 0x22, 0x62,
    0xe, 0x20, 0xa0,

    /* U+004F "O" */
    0x1f, 0x42, 0x9, 0x50, 0x69, 0x2, 0x50, 0x62,
    0x9, 0x1f, 0x40,

    /* U+0050 "P" */
    0x3a, 0x82, 0x9, 0x20, 0x93, 0xa4, 0x20, 0x2,
    0x0, 0x20, 0x0,

    /* U+0051 "Q" */
    0x1f, 0x42, 0x9, 0x50, 0x69, 0x2, 0x50, 0x62,
    0x9, 0x1f, 0xc0, 0x2,

    /* U+0052 "R" */
    0x3a, 0x82, 0x8, 0x20, 0x83, 0xb8, 0x20, 0xc2,
    0x8, 0x20, 0x90,

    /* U+0053 "S" */
    0x2a, 0x46, 0xc, 0x30, 0x1, 0xe0, 0x0, 0xc5,
    0xc, 0x2a, 0x40,

    /* U+0054 "T" */
    0xae, 0x80, 0xc0, 0xc, 0x0, 0xc0, 0xc, 0x0,
    0xc0, 0xc, 0x0,

    /* U+0055 "U" */
    0x60, 0x56, 0x5, 0x60, 0x56, 0x5, 0x60, 0x52,
    0x9, 0x1a, 0x80,

    /* U+0056 "V" */
    0x80, 0x96, 0xc, 0x30, 0x82, 0x14, 0x16, 0x0,
    0xe0, 0x9, 0x0,

    /* U+0057 "W" */
    0x82, 0x46, 0x53, 0x89, 0x22, 0xc8, 0x35, 0x8c,
    0x38, 0x68, 0x2c, 0x34, 0x18, 0x30,

    /* U+0058 "X" */
    0x60, 0xc3, 0x28, 0xf, 0x0, 0xe0, 0xb, 0x3,
    0x18, 0x60, 0xc0,

    /* U+0059 "Y" */
    0x90, 0xc3, 0x18, 0x27, 0x0, 0xe0, 0xc, 0x0,
    0x80, 0x8, 0x0,

    /* U+005A "Z" */
    0x6b, 0xc0, 0x90, 0x60, 0x30, 0x14, 0xc, 0xb,
    0xa8,

    /* U+005B "[" */
    0x71, 0x86, 0x18, 0x61, 0x86, 0x18, 0x70,

    /* U+005C "\\" */
    0x80, 0x60, 0x30, 0x14, 0x8, 0x8, 0x5,

    /* U+005D "]" */
    0xa3, 0x33, 0x33, 0x33, 0xa0,

    /* U+005E "^" */
    0x10, 0x38, 0x2c, 0x95,

    /* U+005F "_" */
    0xaa, 0x0,

    /* U+0060 "`" */
    0x20,

    /* U+0061 "a" */
    0x2a, 0x4, 0x92, 0xb5, 0x49, 0x3a, 0x40,

    /* U+0062 "b" */
    0x60, 0x18, 0x7, 0xb1, 0x86, 0x60, 0x98, 0x66,
    0xb0,

    /* U+0063 "c" */
    0x2a, 0x14, 0x59, 0x1, 0x44, 0x2a, 0x0,

    /* U+0064 "d" */
    0x1, 0x40, 0x52, 0xb5, 0x85, 0x91, 0x54, 0x52,
    0xa4,

    /* U+0065 "e" */
    0x2a, 0x18, 0x9b, 0xb5, 0x40, 0x2a, 0x0,

    /* U+0066 "f" */
    0x2c, 0x30, 0x78, 0x30, 0x30, 0x30, 0x30,

    /* U+0067 "g" */
    0x2a, 0x58, 0x59, 0x15, 0x45, 0x2a, 0x40, 0x52,
    0xe0,

    /* U+0068 "h" */
    0x60, 0x18, 0x6, 0xb1, 0x85, 0x61, 0x98, 0x66,
    0x18,

    /* U+0069 "i" */
    0x60, 0x66, 0x66, 0x60,

    /* U+006A "j" */
    0x8, 0x0, 0x82, 0x8, 0x20, 0x86, 0x34,

    /* U+006B "k" */
    0x60, 0x18, 0x6, 0x31, 0xa4, 0x7c, 0x19, 0x86,
    0x24,

    /* U+006C "l" */
    0x66, 0x66, 0x66, 0x60,

    /* U+006D "m" */
    0x6b, 0x68, 0x62, 0x88, 0x62, 0x48, 0x62, 0x48,
    0x62, 0x48,

    /* U+006E "n" */
    0x6b, 0x18, 0x56, 0x15, 0x85, 0x61, 0x40,

    /* U+006F "o" */
    0x2a, 0x18, 0x69, 0x9, 0x86, 0x2a, 0x0,

    /* U+0070 "p" */
    0x6a, 0x18, 0x66, 0x9, 0x86, 0x7b, 0x18, 0x6,
    0x0,

    /* U+0071 "q" */
    0x2a, 0x58, 0x99, 0x15, 0x49, 0x2b, 0x40, 0x50,
    0x14,

    /* U+0072 "r" */
    0x69, 0x86, 0x18, 0x60,

    /* U+0073 "s" */
    0x2e, 0x18, 0x42, 0x91, 0x8, 0x2a, 0x0,

    /* U+0074 "t" */
    0x32, 0xd3, 0xc, 0x30, 0xd0,

    /* U+0075 "u" */
    0x51, 0x54, 0x55, 0x15, 0x85, 0x2a, 0x40,

    /* U+0076 "v" */
    0x92, 0x18, 0xc3, 0x50, 0xb0, 0xc, 0x0,

    /* U+0077 "w" */
    0x83, 0x15, 0x5c, 0x82, 0x97, 0xa, 0x38, 0x24,
    0x90,

    /* U+0078 "x" */
    0x63, 0xe, 0x41, 0xc0, 0xe4, 0x53, 0x0,

    /* U+0079 "y" */
    0x82, 0x18, 0xc3, 0x60, 0xb0, 0x1c, 0x5, 0x7,
    0x0,

    /* U+007A "z" */
    0x6b, 0x2, 0x41, 0x80, 0xc0, 0xba, 0x0,

    /* U+007B "{" */
    0x8, 0x83, 0xc, 0xa0, 0xc3, 0x8, 0x8,

    /* U+007C "|" */
    0x11, 0x11, 0x11, 0x11,

    /* U+007D "}" */
    0x80, 0x83, 0xc, 0x18, 0xc3, 0x8, 0x80,

    /* U+007E "~" */
    0x28, 0x10, 0x2c,

    /* U+00B0 "°" */
    0x25, 0x22, 0x40,

    /* U+0410 "А" */
    0x9, 0x0, 0xa0, 0x16, 0x2, 0x8, 0x3f, 0xc5,
    0x8, 0x80, 0x60,

    /* U+0411 "Б" */
    0x7a, 0x46, 0x0, 0x60, 0x7, 0xa4, 0x60, 0x86,
    0x8, 0x7a, 0x80,

    /* U+0412 "В" */
    0x3b, 0x42, 0xc, 0x20, 0xc3, 0xb4, 0x20, 0x82,
    0x8, 0x3a, 0x80,

    /* U+0413 "Г" */
    0x3a, 0x88, 0x2, 0x0, 0x80, 0x20, 0x8, 0x2,
    0x0,

    /* U+0414 "Д" */
    0xe, 0xe0, 0x20, 0x81, 0x82, 0x6, 0x8, 0x14,
    0x20, 0xc0, 0x8b, 0xaf, 0x60, 0x6, 0x40, 0x4,

    /* U+0415 "Е" */
    0x3a, 0x82, 0x0, 0x20, 0x3, 0xa4, 0x20, 0x2,
    0x0, 0x3a, 0x80,

    /* U+0416 "Ж" */
    0x61, 0x86, 0xc, 0x63, 0x1, 0x99, 0x40, 0x3f,
    0xc0, 0x19, 0x98, 0xc, 0x63, 0x9, 0x18, 0x70,

    /* U+0417 "З" */
    0x2a, 0x82, 0x9, 0x0, 0x80, 0xb8, 0x0, 0x96,
    0x9, 0x2a, 0x80,

    /* U+0418 "И" */
    0x20, 0xa2, 0xe, 0x22, 0x62, 0x62, 0x2c, 0x23,
    0x82, 0x30, 0x20,

    /* U+0419 "Й" */
    0x4, 0x0, 0x60, 0x20, 0xa2, 0xe, 0x22, 0x62,
    0x62, 0x2c, 0x23, 0x82, 0x30, 0x20,

    /* U+041A "К" */
    0x20, 0x82, 0x18, 0x22, 0x3, 0xd0, 0x23, 0x2,
    0x18, 0x20, 0x90,

    /* U+041B "Л" */
    0x1e, 0xe1, 0x46, 0x14, 0x61, 0x46, 0x24, 0x62,
    0x6, 0xa0, 0x60,

    /* U+041C "М" */
    0x30, 0xc, 0x34, 0x2c, 0x2c, 0x38, 0x28, 0x68,
    0x26, 0x88, 0x23, 0x8c, 0x22, 0x4c,

    /* U+041D "Н" */
    0x20, 0x22, 0x2, 0x20, 0x23, 0xae, 0x20, 0x22,
    0x2, 0x20, 0x20,

    /* U+041E "О" */
    0x1f, 0x42, 0x9, 0x50, 0x69, 0x2, 0x50, 0x62,
    0x9, 0x1f, 0x40,

    /* U+041F "П" */
    0x3a, 0xe2, 0x2, 0x20, 0x22, 0x2, 0x20, 0x22,
    0x2, 0x20, 0x20,

    /* U+0420 "Р" */
    0x3a, 0x82, 0x9, 0x20, 0x93, 0xa4, 0x20, 0x2,
    0x0, 0x20, 0x0,

    /* U+0421 "С" */
    0x1a, 0x42, 0x8, 0x50, 0x5, 0x0, 0x50, 0x2,
    0x8, 0x1a, 0x40,

    /* U+0422 "Т" */
    0xae, 0x80, 0xc0, 0xc, 0x0, 0xc0, 0xc, 0x0,
    0xc0, 0xc, 0x0,

    /* U+0423 "У" */
    0x60, 0xc3, 0xc, 0x25, 0x40, 0xb0, 0xe, 0x0,
    0x80, 0x28, 0x0,

    /* U+0424 "Ф" */
    0x0, 0x0, 0xc, 0x1, 0xb9, 0x18, 0xc9, 0x93,
    0x9, 0x8c, 0x91, 0xb9, 0x0, 0xc0,

    /* U+0425 "Х" */
    0x60, 0xc3, 0x28, 0xf, 0x0, 0xe0, 0xb, 0x3,
    0x18, 0x60, 0xc0,

    /* U+0426 "Ц" */
    0x20, 0x20, 0x80, 0x82, 0x2, 0x8, 0x8, 0x20,
    0x20, 0x80, 0x83, 0xaf, 0x40, 0x6, 0x0, 0x4,

    /* U+0427 "Ч" */
    0x60, 0x56, 0x5, 0x60, 0x52, 0x9, 0x1a, 0xd0,
    0x5, 0x0, 0x50,

    /* U+0428 "Ш" */
    0x20, 0x82, 0x20, 0x82, 0x20, 0x82, 0x20, 0x82,
    0x20, 0x82, 0x20, 0x82, 0x3b, 0xee,

    /* U+0429 "Щ" */
    0x20, 0x82, 0x8, 0x20, 0x82, 0x8, 0x20, 0x82,
    0x8, 0x20, 0x82, 0x8, 0x20, 0x83, 0xbe, 0xf4,
    0x0, 0x5, 0x0, 0x1, 0x0,

    /* U+042A "Ъ" */
    0xa8, 0x0, 0x20, 0x0, 0x80, 0x3, 0xa8, 0x8,
    0x24, 0x20, 0x90, 0xea, 0x0,

    /* U+042B "Ы" */
    0x20, 0xc, 0x20, 0xc, 0x20, 0xc, 0x3a, 0x4c,
    0x20, 0x9c, 0x20, 0x9c, 0x3a, 0x8c,

    /* U+042C "Ь" */
    0x60, 0x6, 0x0, 0x60, 0x7, 0xa4, 0x60, 0x86,
    0x8, 0x7a, 0x80,

    /* U+042D "Э" */
    0x1a, 0x83, 0x9, 0x10, 0x60, 0xae, 0x0, 0x63,
    0x9, 0x1a, 0x80,

    /* U+042E "Ю" */
    0x21, 0xa8, 0x23, 0x9, 0x26, 0x2, 0x3d, 0x3,
    0x26, 0x2, 0x23, 0x9, 0x21, 0xe8,

    /* U+042F "Я" */
    0x1a, 0xc8, 0x36, 0xc, 0xc3, 0x1e, 0xc9, 0x36,
    0xc,

    /* U+0430 "а" */
    0x2a, 0x4, 0x92, 0xb5, 0x49, 0x3a, 0x40,

    /* U+0431 "б" */
    0x2, 0x9, 0x6, 0xa2, 0x85, 0x90, 0x98, 0x62,
    0xa0,

    /* U+0432 "в" */
    0x7b, 0x18, 0x57, 0xb1, 0x86, 0x7b, 0x40,

    /* U+0433 "г" */
    0x79, 0x60, 0x60, 0x60, 0x60,

    /* U+0434 "д" */
    0x2f, 0x82, 0x58, 0x21, 0x83, 0x18, 0xbb, 0xcc,
    0x8, 0x40, 0x40,

    /* U+0435 "е" */
    0x2a, 0x18, 0x9b, 0xb5, 0x40, 0x2a, 0x0,

    /* U+0436 "ж" */
    0x63, 0x24, 0xcd, 0x81, 0xfc, 0xc, 0xcc, 0x93,
    0x24,

    /* U+0437 "з" */
    0x3a, 0x0, 0xc1, 0xe1, 0xc, 0x3a, 0x0,

    /* U+0438 "и" */
    0x52, 0x55, 0xd6, 0xd5, 0xd5, 0x71, 0x40,

    /* U+0439 "й" */
    0x22, 0x2, 0x45, 0x25, 0x5d, 0x6d, 0x5d, 0x57,
    0x14,

    /* U+043A "к" */
    0x62, 0x59, 0x47, 0xc1, 0x98, 0x62, 0x40,

    /* U+043B "л" */
    0x3b, 0x4c, 0x53, 0x14, 0xc5, 0x91, 0x40,

    /* U+043C "м" */
    0x70, 0x77, 0x4b, 0x6c, 0xb6, 0xb7, 0x63, 0x30,

    /* U+043D "н" */
    0x61, 0x58, 0x57, 0xb5, 0x85, 0x61, 0x40,

    /* U+043E "о" */
    0x2a, 0x18, 0x69, 0x9, 0x86, 0x2a, 0x0,

    /* U+043F "п" */
    0x7b, 0x58, 0x56, 0x15, 0x85, 0x61, 0x40,

    /* U+0440 "р" */
    0x6a, 0x18, 0x66, 0x9, 0x86, 0x7b, 0x18, 0x6,
    0x0,

    /* U+0441 "с" */
    0x2a, 0x14, 0x59, 0x1, 0x44, 0x2a, 0x0,

    /* U+0442 "т" */
    0x6e, 0x2, 0x0, 0x80, 0x20, 0x8, 0x0,

    /* U+0443 "у" */
    0x82, 0x18, 0xc3, 0x60, 0xb0, 0x1c, 0x5, 0x7,
    0x0,

    /* U+0444 "ф" */
    0x2, 0x0, 0x8, 0x2, 0xfd, 0x14, 0x8c, 0x92,
    0x31, 0x48, 0xc3, 0xfd, 0x0, 0x80, 0x2, 0x0,

    /* U+0445 "х" */
    0x63, 0xe, 0x41, 0xc0, 0xe4, 0x53, 0x0,

    /* U+0446 "ц" */
    0x61, 0x46, 0x14, 0x61, 0x46, 0x14, 0x7b, 0xc0,
    0xc, 0x0, 0x40,

    /* U+0447 "ч" */
    0x52, 0x54, 0x96, 0x24, 0xad, 0x2, 0x40,

    /* U+0448 "ш" */
    0x63, 0x19, 0x8c, 0x66, 0x31, 0x98, 0xc6, 0x7b,
    0xb8,

    /* U+0449 "щ" */
    0x63, 0x18, 0x63, 0x18, 0x63, 0x18, 0x63, 0x18,
    0x7b, 0xbc, 0x0, 0x9, 0x0, 0x4,

    /* U+044A "ъ" */
    0xb4, 0x1, 0x40, 0x1e, 0x81, 0x49, 0x1e, 0x80,

    /* U+044B "ы" */
    0x20, 0x24, 0x80, 0x93, 0xa2, 0x48, 0x69, 0x3b,
    0x24,

    /* U+044C "ь" */
    0x60, 0x18, 0x7, 0xa1, 0x85, 0x7b, 0x0,

    /* U+044D "э" */
    0x2a, 0x10, 0xc0, 0xb5, 0x48, 0x2a, 0x0,

    /* U+044E "ю" */
    0x61, 0xa1, 0x88, 0x27, 0xe0, 0xd8, 0x82, 0x62,
    0xa0,

    /* U+044F "я" */
    0x2b, 0x58, 0x53, 0xf4, 0xc5, 0x61, 0x40,

    /* U+0451 "ё" */
    0x33, 0x0, 0x2, 0xa1, 0x89, 0xbb, 0x54, 0x2,
    0xa0,

    /* U+2022 "•" */
    0x1, 0xd3, 0x0
};


/*---------------------
 *  GLYPH DESCRIPTION
 *--------------------*/

static const lv_font_fmt_txt_glyph_dsc_t glyph_dsc[] = {
    {.bitmap_index = 0, .adv_w = 0, .box_w = 0, .box_h = 0, .ofs_x = 0, .ofs_y = 0} /* id = 0 reserved */,
    {.bitmap_index = 0, .adv_w = 36, .box_w = 0, .box_h = 0, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 0, .adv_w = 38, .box_w = 2, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 4, .adv_w = 47, .box_w = 3, .box_h = 3, .ofs_x = 0, .ofs_y = 4},
    {.bitmap_index = 7, .adv_w = 90, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 18, .adv_w = 81, .box_w = 5, .box_h = 9, .ofs_x = 0, .ofs_y = -1},
    {.bitmap_index = 30, .adv_w = 105, .box_w = 7, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 43, .adv_w = 90, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 54, .adv_w = 25, .box_w = 2, .box_h = 3, .ofs_x = 0, .ofs_y = 4},
    {.bitmap_index = 56, .adv_w = 48, .box_w = 3, .box_h = 11, .ofs_x = 0, .ofs_y = -3},
    {.bitmap_index = 65, .adv_w = 48, .box_w = 3, .box_h = 11, .ofs_x = 0, .ofs_y = -3},
    {.bitmap_index = 74, .adv_w = 62, .box_w = 4, .box_h = 4, .ofs_x = 0, .ofs_y = 3},
    {.bitmap_index = 78, .adv_w = 82, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 1},
    {.bitmap_index = 85, .adv_w = 28, .box_w = 2, .box_h = 3, .ofs_x = 0, .ofs_y = -1},
    {.bitmap_index = 87, .adv_w = 39, .box_w = 3, .box_h = 1, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 88, .adv_w = 39, .box_w = 2, .box_h = 1, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 89, .adv_w = 60, .box_w = 4, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 96, .adv_w = 81, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 105, .adv_w = 81, .box_w = 3, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 111, .adv_w = 81, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 120, .adv_w = 81, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 129, .adv_w = 81, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 138, .adv_w = 81, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 147, .adv_w = 81, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 156, .adv_w = 81, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 165, .adv_w = 81, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 174, .adv_w = 81, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 183, .adv_w = 36, .box_w = 2, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 186, .adv_w = 37, .box_w = 2, .box_h = 6, .ofs_x = 0, .ofs_y = -1},
    {.bitmap_index = 189, .adv_w = 73, .box_w = 4, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 194, .adv_w = 81, .box_w = 5, .box_h = 3, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 198, .adv_w = 75, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 205, .adv_w = 68, .box_w = 4, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 212, .adv_w = 129, .box_w = 8, .box_h = 9, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 230, .adv_w = 93, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 241, .adv_w = 92, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 252, .adv_w = 91, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 263, .adv_w = 95, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 274, .adv_w = 84, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 285, .adv_w = 84, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 296, .adv_w = 98, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 307, .adv_w = 103, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 318, .adv_w = 41, .box_w = 2, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 322, .adv_w = 79, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 331, .adv_w = 93, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 342, .adv_w = 78, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 351, .adv_w = 126, .box_w = 8, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 365, .adv_w = 103, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 376, .adv_w = 98, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 387, .adv_w = 92, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 398, .adv_w = 98, .box_w = 6, .box_h = 8, .ofs_x = 0, .ofs_y = -1},
    {.bitmap_index = 410, .adv_w = 95, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 421, .adv_w = 90, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 432, .adv_w = 84, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 443, .adv_w = 97, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 454, .adv_w = 91, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 465, .adv_w = 127, .box_w = 8, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 479, .adv_w = 91, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 490, .adv_w = 88, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 501, .adv_w = 86, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 510, .adv_w = 39, .box_w = 3, .box_h = 9, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 517, .adv_w = 59, .box_w = 4, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 524, .adv_w = 39, .box_w = 2, .box_h = 9, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 529, .adv_w = 60, .box_w = 4, .box_h = 4, .ofs_x = 0, .ofs_y = 3},
    {.bitmap_index = 533, .adv_w = 65, .box_w = 5, .box_h = 1, .ofs_x = 0, .ofs_y = -1},
    {.bitmap_index = 535, .adv_w = 45, .box_w = 3, .box_h = 1, .ofs_x = 0, .ofs_y = 6},
    {.bitmap_index = 536, .adv_w = 79, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 543, .adv_w = 82, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 552, .adv_w = 76, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 559, .adv_w = 82, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 568, .adv_w = 76, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 575, .adv_w = 50, .box_w = 4, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 582, .adv_w = 82, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 591, .adv_w = 82, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 600, .adv_w = 36, .box_w = 2, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 604, .adv_w = 37, .box_w = 3, .box_h = 9, .ofs_x = -1, .ofs_y = -2},
    {.bitmap_index = 611, .adv_w = 74, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 620, .adv_w = 36, .box_w = 2, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 624, .adv_w = 126, .box_w = 8, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 634, .adv_w = 82, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 641, .adv_w = 82, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 648, .adv_w = 82, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 657, .adv_w = 82, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 666, .adv_w = 49, .box_w = 3, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 670, .adv_w = 75, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 677, .adv_w = 50, .box_w = 3, .box_h = 6, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 682, .adv_w = 82, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 689, .adv_w = 72, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 696, .adv_w = 109, .box_w = 7, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 705, .adv_w = 72, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 712, .adv_w = 72, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 721, .adv_w = 72, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 728, .adv_w = 49, .box_w = 3, .box_h = 9, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 735, .adv_w = 36, .box_w = 2, .box_h = 8, .ofs_x = 0, .ofs_y = -1},
    {.bitmap_index = 739, .adv_w = 49, .box_w = 3, .box_h = 9, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 746, .adv_w = 98, .box_w = 6, .box_h = 2, .ofs_x = 0, .ofs_y = 2},
    {.bitmap_index = 749, .adv_w = 54, .box_w = 3, .box_h = 3, .ofs_x = 0, .ofs_y = 4},
    {.bitmap_index = 752, .adv_w = 93, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 763, .adv_w = 91, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 774, .adv_w = 92, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 785, .adv_w = 80, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 794, .adv_w = 109, .box_w = 7, .box_h = 9, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 810, .adv_w = 84, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 821, .adv_w = 131, .box_w = 9, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 837, .adv_w = 97, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 848, .adv_w = 103, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 859, .adv_w = 103, .box_w = 6, .box_h = 9, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 873, .adv_w = 93, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 884, .adv_w = 102, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 895, .adv_w = 126, .box_w = 8, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 909, .adv_w = 103, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 920, .adv_w = 98, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 931, .adv_w = 103, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 942, .adv_w = 92, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 953, .adv_w = 91, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 964, .adv_w = 84, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 975, .adv_w = 90, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 986, .adv_w = 112, .box_w = 7, .box_h = 8, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1000, .adv_w = 91, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1011, .adv_w = 111, .box_w = 7, .box_h = 9, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 1027, .adv_w = 99, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1038, .adv_w = 136, .box_w = 8, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1052, .adv_w = 140, .box_w = 9, .box_h = 9, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 1073, .adv_w = 109, .box_w = 7, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1086, .adv_w = 125, .box_w = 8, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1100, .adv_w = 91, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1111, .adv_w = 97, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1122, .adv_w = 128, .box_w = 8, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1136, .adv_w = 92, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1145, .adv_w = 79, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1152, .adv_w = 80, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1161, .adv_w = 82, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1168, .adv_w = 60, .box_w = 4, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1173, .adv_w = 88, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 1184, .adv_w = 76, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1191, .adv_w = 110, .box_w = 7, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1200, .adv_w = 73, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1207, .adv_w = 82, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1214, .adv_w = 82, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1223, .adv_w = 76, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1230, .adv_w = 80, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1237, .adv_w = 107, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1245, .adv_w = 82, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1252, .adv_w = 82, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1259, .adv_w = 82, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1266, .adv_w = 82, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 1275, .adv_w = 76, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1282, .adv_w = 74, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1289, .adv_w = 72, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 1298, .adv_w = 104, .box_w = 7, .box_h = 9, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 1314, .adv_w = 72, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1321, .adv_w = 86, .box_w = 6, .box_h = 7, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 1332, .adv_w = 80, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1339, .adv_w = 116, .box_w = 7, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1348, .adv_w = 122, .box_w = 8, .box_h = 7, .ofs_x = 0, .ofs_y = -2},
    {.bitmap_index = 1362, .adv_w = 89, .box_w = 6, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1370, .adv_w = 114, .box_w = 7, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1379, .adv_w = 78, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1386, .adv_w = 77, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1393, .adv_w = 117, .box_w = 7, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1402, .adv_w = 82, .box_w = 5, .box_h = 5, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1409, .adv_w = 76, .box_w = 5, .box_h = 7, .ofs_x = 0, .ofs_y = 0},
    {.bitmap_index = 1418, .adv_w = 49, .box_w = 3, .box_h = 3, .ofs_x = 0, .ofs_y = 2}
};

/*---------------------
 *  CHARACTER MAPPING
 *--------------------*/

static const uint16_t unicode_list_3[] = {
    0x0, 0x1bd1
};

/*Collect the unicode lists and glyph_id offsets*/
static const lv_font_fmt_txt_cmap_t cmaps[] =
{
    {
        .range_start = 32, .range_length = 95, .glyph_id_start = 1,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 176, .range_length = 1, .glyph_id_start = 96,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 1040, .range_length = 64, .glyph_id_start = 97,
        .unicode_list = NULL, .glyph_id_ofs_list = NULL, .list_length = 0, .type = LV_FONT_FMT_TXT_CMAP_FORMAT0_TINY
    },
    {
        .range_start = 1105, .range_length = 7122, .glyph_id_start = 161,
        .unicode_list = unicode_list_3, .glyph_id_ofs_list = NULL, .list_length = 2, .type = LV_FONT_FMT_TXT_CMAP_SPARSE_TINY
    }
};

/*-----------------
 *    KERNING
 *----------------*/


/*Map glyph_ids to kern left classes*/
static const uint8_t kern_left_class_mapping[] =
{
    0, 0, 0, 1, 0, 0, 0, 0,
    1, 2, 0, 0, 0, 3, 0, 3,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 3, 0, 0, 0, 0,
    0, 0, 4, 5, 6, 7, 8, 9,
    0, 10, 10, 11, 12, 13, 10, 10,
    7, 14, 15, 16, 0, 17, 11, 18,
    19, 20, 21, 22, 23, 0, 0, 0,
    0, 0, 24, 25, 26, 0, 27, 28,
    0, 29, 0, 0, 30, 0, 29, 29,
    31, 25, 0, 32, 0, 0, 0, 33,
    34, 35, 33, 36, 37, 0, 0, 0,
    0, 4, 38, 5, 39, 40, 8, 20,
    41, 10, 0, 12, 10, 10, 10, 7,
    0, 14, 6, 17, 42, 0, 20, 10,
    0, 10, 43, 44, 0, 44, 45, 46,
    47, 24, 48, 49, 50, 51, 27, 35,
    26, 0, 0, 52, 0, 0, 0, 31,
    0, 25, 26, 53, 33, 25, 35, 54,
    0, 0, 55, 56, 0, 56, 25, 57,
    0, 27, 0
};

/*Map glyph_ids to kern right classes*/
static const uint8_t kern_right_class_mapping[] =
{
    0, 0, 0, 1, 0, 0, 0, 2,
    1, 0, 3, 4, 0, 5, 6, 5,
    0, 0, 0, 0, 0, 0, 0, 0,
    7, 0, 0, 5, 0, 0, 0, 0,
    8, 0, 9, 0, 10, 0, 0, 0,
    10, 0, 0, 11, 0, 0, 0, 0,
    10, 0, 10, 0, 12, 13, 14, 15,
    16, 17, 18, 19, 0, 0, 20, 0,
    0, 0, 21, 0, 22, 22, 22, 23,
    22, 0, 0, 0, 0, 0, 24, 24,
    25, 24, 22, 26, 27, 28, 29, 30,
    31, 32, 30, 33, 0, 0, 34, 0,
    0, 9, 0, 0, 0, 35, 0, 17,
    0, 0, 0, 0, 36, 0, 0, 10,
    0, 0, 10, 13, 37, 0, 17, 0,
    38, 0, 0, 0, 0, 39, 40, 0,
    0, 21, 41, 42, 24, 43, 22, 32,
    44, 24, 24, 24, 45, 24, 24, 25,
    24, 24, 22, 46, 30, 22, 32, 24,
    47, 24, 24, 0, 48, 24, 49, 24,
    50, 22, 51
};

/*Kern values between classes*/
static const int8_t kern_class_values[] =
{
    -3, 0, 0, 0, 0, 0, 0, 0,
    -8, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, -4, -4, 0, -1,
    -6, 0, -6, 0, 0, 0, 1, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 1, 3, 0, 2, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -20, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    -6, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, -1, 0, 0, -2,
    0, 0, 0, 1, 0, 0, 0, -4,
    0, 0, 0, 0, 0, 0, -4, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    -2, 0, -2, 0, 0, -4, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    -1, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, -2, 0, 0, 0, 0, 0, 0,
    0, 0, 0, -2, 0, 0, 0, 0,
    0, 0, -1, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    -1, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -9, 0,
    0, 0, -1, 0, 0, 0, -2, 0,
    -2, 0, -2, -3, -2, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, -2, -2, 0, 0,
    -2, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 1, 0, 0, 0, 0, 0, 0,
    0, 0, -1, -1, 0, -1, 0, 0,
    0, -1, -2, -2, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, -19, 0, 0, 0,
    -4, 0, 0, 0, 1, 0, 0, 0,
    0, 0, 0, 0, -2, -1, 0, 0,
    -1, -2, 0, 0, -2, -2, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 1, 0, 0, 0, -2,
    0, 0, 0, 1, -2, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 1, 1, 0,
    -2, 0, 0, 0, 0, 1, 0, 1,
    0, -2, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -2, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -11, 0,
    0, 0, -2, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -2, 0,
    0, -2, 0, 0, 0, -2, -3, -4,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, -3, 0, 0, 0, 0, -5, -7,
    0, 0, 0, 0, -18, 0, 0, 0,
    0, 0, 0, 0, 1, -2, 0, 0,
    -14, -2, -14, -7, 0, -20, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    -1, -9, -4, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, -28, 0, 0, 0, -12,
    0, 0, 0, 0, 0, 0, 0, -4,
    0, -2, 0, -1, -1, 0, 0, -1,
    0, 0, 1, 0, 1, 0, 0, 0,
    0, -17, -10, 0, 0, 0, 0, 0,
    0, -12, 0, -6, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -2, 0,
    -2, -1, 0, -2, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, -4, 0, -1, 0, 0, -3, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, -18, -19, 0, 0,
    -8, -2, 0, -1, 1, 0, 1, 1,
    0, 1, 0, 0, -6, -6, 0, -6,
    -6, -5, -5, 0, -5, -6, -3, -5,
    -4, 0, -6, -4, 0, 0, 1, 0,
    -2, -7, -10, -9, -9, -5, -9, -9,
    -9, -9, 0, 0, 0, 1, 0, -15,
    -11, 0, 0, -5, -1, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 1, -3,
    -3, 0, 0, -3, -2, 0, 0, -2,
    -1, 0, 0, 0, 1, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    1, 0, -10, -4, 0, 0, -3, 0,
    0, 0, 1, 0, 0, 0, 0, 0,
    0, 1, -2, -2, 0, 0, -2, -1,
    0, 0, -1, 0, 0, 0, 0, 1,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -11, 0,
    0, 0, -2, 0, 0, 0, 0, 1,
    0, 0, 0, 0, 0, 0, -2, 0,
    0, -1, 0, 0, 0, -1, -2, 0,
    0, 0, 0, 1, 1, 0, 0, 0,
    0, -2, 0, 0, 0, 1, -3, -3,
    0, 0, 0, 0, 0, -2, 1, -3,
    -16, -11, 0, 0, -10, -2, -7, -1,
    1, -7, 1, 1, 1, 1, 0, 1,
    -4, -5, -2, -3, -5, -3, -4, -2,
    -3, -1, 0, -2, -2, 1, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -3, 0,
    0, 0, 0, 0, 0, 0, 0, 1,
    -2, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, -1, 0, 0, -1,
    0, 0, 0, -1, -2, -2, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, -1, 0, 0, -1,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, -1, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, -1, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, -1, 0, 0, 0, 0, 0,
    -2, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, -1, 0, -1,
    -1, 0, 0, 0, 0, 0, 0, 0,
    0, 0, -1, 0, -1, -1, 0, 0,
    0, 0, 0, -1, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -1, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, -1, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, -1, 0, 0, 0, 0,
    0, 1, 0, 1, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 1, 0, -2, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 1, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, -1, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, -1, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, -1, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, -1,
    0, -1, -1, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -1, -2,
    0, 0, 0, 0, 0, 1, 0, 0,
    0, -12, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, -1, 1, 0, -1, 0, 0,
    1, 0, 1, 1, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    1, 0, 0, 0, -12, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, -1, -1, 1, 0,
    -1, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, -4, 0, -3, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, -9,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, -1, 0, 0, -3, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -1, 0,
    0, -1, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -1, 0,
    0, -1, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, -2, 0, -2, 0, -1,
    -2, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -1, 0,
    0, 0, 0, -1, -2, -2, 0, 0,
    0, 0, 0, 0, -3, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -32, -34,
    0, 0, -14, -5, 0, -3, 0, 0,
    0, 0, 0, 0, 0, 0, -11, -12,
    0, -12, -11, -9, -11, 0, -9, -11,
    -7, -11, -9, 0, -11, -8, 0, 0,
    0, 0, -5, -13, -18, -17, -17, -11,
    -17, -17, -17, -18, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 1, -2, 0,
    0, -2, 0, -2, 0, 0, -2, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 1,
    1, 0, -2, -2, 0, 0, 0, 1,
    0, 1, 0, -2, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -1, 0,
    0, 0, 0, 0, -1, 0, -1, 0,
    -1, -1, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, -1, -1, 0, -1, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, -28,
    -14, 0, 0, -6, -2, 0, 0, 1,
    0, 0, 0, 0, 1, 0, 0, -6,
    -5, 0, -6, -5, 0, -3, 0, 0,
    0, 0, 0, 0, 0, -6, -4, 0,
    0, 1, 0, 0, -2, -6, -3, -5,
    0, -2, -2, 0, -3, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 1, 0,
    0, 0, -2, 0, -2, 0, 1, -2,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    1, 1, 1, -2, -2, -1, 0, 0,
    1, 0, 1, -2, -2, 0, 0, 0,
    0, -4, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, -7, 0, -4,
    0, 0, -6, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    -4, 0, 0, 0, 0, -1, -2, -4,
    0, 0, 0, 0, 0, 0, -3, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    -2, 0, 0, 0, -2, -2, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -2, -2,
    -2, 0, 0, 0, 0, 0, 0, 0,
    -2, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, -2, 0, 0, 0, -2,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, -2, -2, -2, 0, 0, 0, 0,
    0, -2, 0, -1, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -1, 0,
    0, 0, 0, -1, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, -1, 0, 0, 0,
    0, 0, 0, 0, -1, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, -1,
    0, 0, -1, 0, 0, 0, 0, 0,
    -1, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, -1, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, -1, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    -1, 0, 0, -1, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, -4, 0, -3,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    1, 0, 0, -1, -1, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -1, 0,
    0, -4, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 1, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    -1, -1, 1, 0, -2, 0, 0, 0,
    0, 1, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, -4, 0,
    -3, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 1, 0, 1, -1, -1, 0, 0,
    1, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, -1,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 1, 0, 1, -2,
    -2, 0, 0, 0, 0, -9, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, -2, 0, -1, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, -5, -1, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, -1, 0, -1,
    0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, -1, 0, -1, 0, 0, 0,
    0, 0, 0
};


/*Collect the kern class' data in one place*/
static const lv_font_fmt_txt_kern_classes_t kern_classes =
{
    .class_pair_values   = kern_class_values,
    .left_class_mapping  = kern_left_class_mapping,
    .right_class_mapping = kern_right_class_mapping,
    .left_class_cnt      = 57,
    .right_class_cnt     = 51,
};

/*--------------------
 *  ALL CUSTOM DATA
 *--------------------*/

#if LVGL_VERSION_MAJOR == 8
/*Store all the custom data of the font*/
static  lv_font_fmt_txt_glyph_cache_t cache;
#endif

#if LVGL_VERSION_MAJOR >= 8
static const lv_font_fmt_txt_dsc_t font_dsc = {
#else
static lv_font_fmt_txt_dsc_t font_dsc = {
#endif
    .glyph_bitmap = glyph_bitmap,
    .glyph_dsc = glyph_dsc,
    .cmaps = cmaps,
    .kern_dsc = &kern_classes,
    .kern_scale = 16,
    .cmap_num = 4,
    .bpp = 2,
    .kern_classes = 1,
    .bitmap_format = 0,
#if LVGL_VERSION_MAJOR == 8
    .cache = &cache
#endif
};



/*-----------------
 *  PUBLIC FONT
 *----------------*/

/*Initialize a public general font descriptor*/
#if LVGL_VERSION_MAJOR >= 8
const lv_font_t ui_font_number9 = {
#else
lv_font_t ui_font_number9 = {
#endif
    .get_glyph_dsc = lv_font_get_glyph_dsc_fmt_txt,    /*Function pointer to get glyph's data*/
    .get_glyph_bitmap = lv_font_get_bitmap_fmt_txt,    /*Function pointer to get glyph's bitmap*/
    .line_height = 12,          /*The maximum line height required by the font*/
    .base_line = 3,             /*Baseline measured from the bottom of the line*/
#if !(LVGL_VERSION_MAJOR == 6 && LVGL_VERSION_MINOR == 0)
    .subpx = LV_FONT_SUBPX_NONE,
#endif
#if LV_VERSION_CHECK(7, 4, 0) || LVGL_VERSION_MAJOR >= 8
    .underline_position = -1,
    .underline_thickness = 0,
#endif
    .dsc = &font_dsc,          /*The custom font data. Will be accessed by `get_glyph_bitmap/dsc` */
#if LV_VERSION_CHECK(8, 2, 0) || LVGL_VERSION_MAJOR >= 9
    .fallback = NULL,
#endif
    .user_data = NULL,
};



#endif /*#if UI_FONT_NUMBER9*/

